Catalogs/ПараметрыПолученияОбращенийComagic.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ПараметрыПолученияОбращенийComagic</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Login</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучатьОбращения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыПериодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыПериодов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПараметрыПолученияОбращенийComagic/Ext/ObjectModule.bsl
Функция РасчитатьПериодНачало(ПериодОкончание, ВидРасчетногоЗначения) Экспорт 
	
	Сутки = 60*60*24;
	Если ВидРасчетногоЗначения = Перечисления.ВидыПериодов.День Тогда 
        Возврат ПериодОкончание - Сутки; 
    ИначеЕсли ВидРасчетногоЗначения = Перечисления.ВидыПериодов.Неделя Тогда
        Возврат ПериодОкончание - Сутки * 7;
    ИначеЕсли ВидРасчетногоЗначения = Перечисления.ВидыПериодов.Месяц Тогда
        Возврат ДобавитьМесяц(ПериодОкончание, -1);
    ИначеЕсли ВидРасчетногоЗначения = Перечисления.ВидыПериодов.Квартал  Тогда
        Возврат ДобавитьМесяц(ПериодОкончание, -3);
    ИначеЕсли ВидРасчетногоЗначения = Перечисления.ВидыПериодов.Полугодие Тогда
        Возврат ДобавитьМесяц(ПериодОкончание, -6);
    ИначеЕсли ВидРасчетногоЗначения = 	Перечисления.ВидыПериодов.Год Тогда
        Возврат ДобавитьМесяц(ПериодОкончание, -12);
	КонецЕсли;
	
    Возврат НачалоДня(ПериодОкончание);
	
КонецФункции

Процедура ПередЗаписью(Отказ)
		
	Если Не ЗначениеЗаполнено(ВидПериода) Тогда
		ВидПериода = Перечисления.ВидыПериодов.Дата;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ПериодНачало) Тогда
   		ПериодНачало = НачалоДня(ТекущаяДата()) 	
	КонецЕсли; 

	Если Не ЗначениеЗаполнено(ПериодОкончание) Тогда		
		ПериодОкончание = КонецДня(ТекущаяДата());	
	КонецЕсли; 
	
	Если НЕ ВидПериода = Перечисления.ВидыПериодов.Дата Тогда
		ПериодНачало = НачалоДня(РасчитатьПериодНачало(ПериодОкончание, ВидПериода));		
	КонецЕсли;
		
КонецПроцедуры
